###################################################################

# Created by write_sdc on Thu Jan 17 01:24:24 2019

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
create_clock [get_ports {clk[0]}]  -name clk  -period 30  -waveform {0 15}
set_clock_latency -source 1.5  [get_clocks clk]
set_clock_uncertainty -setup 3  [get_clocks clk]
set_clock_transition -max -rise 6 [get_clocks clk]
set_clock_transition -max -fall 6 [get_clocks clk]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[7]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[6]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[5]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[4]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[3]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[2]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[1]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_low[0]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[7]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[6]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[5]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[4]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[3]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[2]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[1]}]
set_output_delay -clock clk  -max 15  [get_ports {dout_high[0]}]
set_output_delay -clock clk  -max 15  [get_ports {zero[0]}]
set_output_delay -clock clk  -max 15  [get_ports {error[0]}]
set_input_transition -max 3  [get_ports {clk[0]}]
set_input_transition -min 0.3  [get_ports {clk[0]}]
set_input_transition -max 3  [get_ports {rst[0]}]
set_input_transition -min 0.3  [get_ports {rst[0]}]
set_input_transition -max 3  [get_ports {cmdin[5]}]
set_input_transition -min 0.3  [get_ports {cmdin[5]}]
set_input_transition -max 3  [get_ports {cmdin[4]}]
set_input_transition -min 0.3  [get_ports {cmdin[4]}]
set_input_transition -max 3  [get_ports {cmdin[3]}]
set_input_transition -min 0.3  [get_ports {cmdin[3]}]
set_input_transition -max 3  [get_ports {cmdin[2]}]
set_input_transition -min 0.3  [get_ports {cmdin[2]}]
set_input_transition -max 3  [get_ports {cmdin[1]}]
set_input_transition -min 0.3  [get_ports {cmdin[1]}]
set_input_transition -max 3  [get_ports {cmdin[0]}]
set_input_transition -min 0.3  [get_ports {cmdin[0]}]
set_input_transition -max 3  [get_ports {din_1[7]}]
set_input_transition -min 0.3  [get_ports {din_1[7]}]
set_input_transition -max 3  [get_ports {din_1[6]}]
set_input_transition -min 0.3  [get_ports {din_1[6]}]
set_input_transition -max 3  [get_ports {din_1[5]}]
set_input_transition -min 0.3  [get_ports {din_1[5]}]
set_input_transition -max 3  [get_ports {din_1[4]}]
set_input_transition -min 0.3  [get_ports {din_1[4]}]
set_input_transition -max 3  [get_ports {din_1[3]}]
set_input_transition -min 0.3  [get_ports {din_1[3]}]
set_input_transition -max 3  [get_ports {din_1[2]}]
set_input_transition -min 0.3  [get_ports {din_1[2]}]
set_input_transition -max 3  [get_ports {din_1[1]}]
set_input_transition -min 0.3  [get_ports {din_1[1]}]
set_input_transition -max 3  [get_ports {din_1[0]}]
set_input_transition -min 0.3  [get_ports {din_1[0]}]
set_input_transition -max 3  [get_ports {din_2[7]}]
set_input_transition -min 0.3  [get_ports {din_2[7]}]
set_input_transition -max 3  [get_ports {din_2[6]}]
set_input_transition -min 0.3  [get_ports {din_2[6]}]
set_input_transition -max 3  [get_ports {din_2[5]}]
set_input_transition -min 0.3  [get_ports {din_2[5]}]
set_input_transition -max 3  [get_ports {din_2[4]}]
set_input_transition -min 0.3  [get_ports {din_2[4]}]
set_input_transition -max 3  [get_ports {din_2[3]}]
set_input_transition -min 0.3  [get_ports {din_2[3]}]
set_input_transition -max 3  [get_ports {din_2[2]}]
set_input_transition -min 0.3  [get_ports {din_2[2]}]
set_input_transition -max 3  [get_ports {din_2[1]}]
set_input_transition -min 0.3  [get_ports {din_2[1]}]
set_input_transition -max 3  [get_ports {din_2[0]}]
set_input_transition -min 0.3  [get_ports {din_2[0]}]
set_input_transition -max 3  [get_ports {din_3[7]}]
set_input_transition -min 0.3  [get_ports {din_3[7]}]
set_input_transition -max 3  [get_ports {din_3[6]}]
set_input_transition -min 0.3  [get_ports {din_3[6]}]
set_input_transition -max 3  [get_ports {din_3[5]}]
set_input_transition -min 0.3  [get_ports {din_3[5]}]
set_input_transition -max 3  [get_ports {din_3[4]}]
set_input_transition -min 0.3  [get_ports {din_3[4]}]
set_input_transition -max 3  [get_ports {din_3[3]}]
set_input_transition -min 0.3  [get_ports {din_3[3]}]
set_input_transition -max 3  [get_ports {din_3[2]}]
set_input_transition -min 0.3  [get_ports {din_3[2]}]
set_input_transition -max 3  [get_ports {din_3[1]}]
set_input_transition -min 0.3  [get_ports {din_3[1]}]
set_input_transition -max 3  [get_ports {din_3[0]}]
set_input_transition -min 0.3  [get_ports {din_3[0]}]
